20250707110039-lesson_3_connect_to_the_customer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 3 Connect to the customer</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 3 Connect to the customer</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd698f9c">1. 3.1 Apply Customer centricity and design thinking</a>
<ul>
<li><a href="#org7b71b6f">1.1. Personas</a></li>
<li><a href="#org6572248">1.2. Empathy Map</a></li>
</ul>
</li>
<li><a href="#orgfc419ad">2. 3.2 Recognize product vision and roadmaps</a>
<ul>
<li><a href="#orgc3fc9a9">2.1. Vision alignes everyone on the product's direction</a></li>
<li><a href="#org45fafcb">2.2. Roadmaps forecast upcoming work to realize the product vision</a></li>
<li><a href="#org1de7879">2.3. Architectural Runway supports vision execution</a>
<ul>
<li><a href="#orgef40546">2.3.1. Intentional architecture</a></li>
<li><a href="#orga4abfb3">2.3.2. Emergent design</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc9d7c2e">3. 3.3 Define the work of customer</a>
<ul>
<li><a href="#org927dfd8">3.1. Features represent the work for the ART</a></li>
<li><a href="#orgc304b70">3.2. Teams break down features into User stories and Enabler stories</a></li>
<li><a href="#orgb83eb69">3.3. Writing Good stories</a></li>
<li><a href="#orgd87b3d5">3.4. Enabler stories</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd698f9c" class="outline-2">
<h2 id="orgd698f9c"><span class="section-number-2">1.</span> 3.1 Apply Customer centricity and design thinking</h2>
<div class="outline-text-2" id="text-1">
<p>
Design thinking is a customer centric development process
Customer-Centric organizations deliver solutions that are designed with a deep understanding of customer needs.
</p>
</div>

<div id="outline-container-org7b71b6f" class="outline-3">
<h3 id="org7b71b6f"><span class="section-number-3">1.1.</span> Personas</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Personas are fictional characters that represent the different people who might use your product.
</p>

<ul class="org-ul">
<li>Personas convey the problems they're facing in context and key triggers for using the product.</li>
<li>Capture rich, concise information that inspires great products without unnecessary details.</li>
</ul>
</div>
</div>

<div id="outline-container-org6572248" class="outline-3">
<h3 id="org6572248"><span class="section-number-3">1.2.</span> Empathy Map</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Used to identify with Customers.
</p>
<ul class="org-ul">
<li>Empathy Map is a tool that helps teams develop deep, shared understanding and empathy for the customer.</li>
<li>Use it to design better user Experiences and value streams.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfc419ad" class="outline-2">
<h2 id="orgfc419ad"><span class="section-number-2">2.</span> 3.2 Recognize product vision and roadmaps</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc3fc9a9" class="outline-3">
<h3 id="orgc3fc9a9"><span class="section-number-3">2.1.</span> Vision alignes everyone on the product's direction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The product vision is a description of the future state of the product.
</p>
<ul class="org-ul">
<li>How will the product solve our customer's problems?</li>
<li>What features does it have?</li>
<li>How will it differentatie us?</li>
<li>What Non-Functional requirements (NFR) does it deliver?</li>
</ul>
</div>
</div>

<div id="outline-container-org45fafcb" class="outline-3">
<h3 id="org45fafcb"><span class="section-number-3">2.2.</span> Roadmaps forecast upcoming work to realize the product vision</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Hierarchical Roadmaps provide multiple planning horizions</li>
<li>Roadmaps communicate intent without over-constraining the implementation.</li>
</ul>
</div>
</div>

<div id="outline-container-org1de7879" class="outline-3">
<h3 id="org1de7879"><span class="section-number-3">2.3.</span> Architectural Runway supports vision execution</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Enables build up the runway
Features consume it
</p>
</div>

<div id="outline-container-orgef40546" class="outline-4">
<h4 id="orgef40546"><span class="section-number-4">2.3.1.</span> Intentional architecture</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Fosters team alignment and defines the Architectural Runway.
</p>
</div>
</div>

<div id="outline-container-orga4abfb3" class="outline-4">
<h4 id="orga4abfb3"><span class="section-number-4">2.3.2.</span> Emergent design</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Teams grow the system design as User Stories require
</p>

<p>
A balance between intentional architeture and emergent  design is required for speed of development and maintainability.
</p>
<ul class="org-ul">
<li>Every team deserves to see the bigger picture</li>
<li>Every team is empowered to design their part.</li>
</ul>
</div>
</div>
</div>
</div>



<div id="outline-container-orgc9d7c2e" class="outline-2">
<h2 id="orgc9d7c2e"><span class="section-number-2">3.</span> 3.3 Define the work of customer</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org927dfd8" class="outline-3">
<h3 id="org927dfd8"><span class="section-number-3">3.1.</span> Features represent the work for the ART</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Feature benefit hypothesis justifies development cost, customer value, and provides business perspective for decision making.</li>
<li>Features contain acceptance criteria typically defined as part of refining the ART backlog.</li>
<li>They reflect  functional and nonfunctional requirements.</li>
<li>Features can be completed within a PI timebox.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc304b70" class="outline-3">
<h3 id="orgc304b70"><span class="section-number-3">3.2.</span> Teams break down features into User stories and Enabler stories</h3>
<div class="outline-text-3" id="text-3-2">
<p>
User stores are short descriptions of a small piece of desired functionality, written in the user's language.
Recommended form of expression is the user-voice form:
As a (user role), I want to (activity), so that (business value).
</p>

<p>
(I)ndependant
(N)egotiable
(V)aluable
(E)stimable
(S)mall
(T)estable
</p>
</div>
</div>

<div id="outline-container-orgb83eb69" class="outline-3">
<h3 id="orgb83eb69"><span class="section-number-3">3.3.</span> Writing Good stories</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Card</li>
<li>Conversation</li>
<li>Confirmation</li>
</ul>
</div>
</div>

<div id="outline-container-orgd87b3d5" class="outline-3">
<h3 id="orgd87b3d5"><span class="section-number-3">3.4.</span> Enabler stories</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Enabler stories build the groundwork for future User Stories.
Four types of enabler stories:
</p>
<ul class="org-ul">
<li>Infrastructure</li>
<li>Architecture</li>
<li>Exploration</li>
<li>Compliance</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
